/**
 * Воспользовавшись преимуществом подхода хранения методов в прототипе
 * с занятия "Наследование, Прототипирование",  обновить
 * функцию-конструктор "Габургер" из пердыдущего задания.
 *
 * Подход "Модуль", который требовалось сделать в прошлом задании,
 * должен тоже присутстовать.
 *
 * @constructor
 * @param size        Размер
 * @param stuffing    Начинка
 */
function Hamburger(size, stuffing) {
    /*
        Тело конструктора из предыдущего задания
        ...
     */
}

